bekencorp/bk_idk/middleware/soc/bk7258/hal/sys_hal.c
}

void sys_hal_cpu0_main_int_ctrl(dev_clk_pwr_ctrl_t clock_state)
{
    sys_ll_set_cpu0_int_halt_clk_op_cpu0_int_mask( clock_state);
}

void sys_hal_cpu1_main_int_ctrl(dev_clk_pwr_ctrl_t clock_state)
{
    sys_ll_set_cpu1_int_halt_clk_op_cpu1_int_mask( clock_state);
}

void sys_hal_set_cpu1_boot_address_offset(uint32_t address_offset)
{
    sys_ll_set_cpu1_int_halt_clk_op_cpu1_offset(address_offset);
}

void sys_hal_set_cpu2_boot_address_offset(uint32_t address_offset)
{
    sys_ll_set_cpu2_int_halt_clk_op_cpu2_offset(address_offset);
}

void sys_hal_set_cpu1_reset(uint32_t reset_value)
{
    /*1:reset ; 0:not reset*/
    sys_ll_set_cpu1_int_halt_clk_op_cpu1_sw_rst(reset_value);
}

void sys_hal_set_cpu2_reset(uint32_t reset_value)
{
    /*1:reset ; 0:not reset*/
    sys_ll_set_cpu2_int_halt_clk_op_cpu2_sw_rst(reset_value);
}

void sys_hal_all_modules_clk_div_set(clk_div_reg_e reg, uint32_t value)
{
    clk_div_address_map_t clk_div_address_map_table[] = CLK_DIV_ADDRESS_MAP;
    clk_div_address_map_t *clk_div_addr = &clk_div_address_map_table[reg];

    uint32_t clk_div_reg_address = clk_div_addr->reg_address;

	REG_WRITE(clk_div_reg_address, value);
}

uint32_t sys_hal_all_modules_clk_div_get(clk_div_reg_e reg)
{
    clk_div_address_map_t clk_div_address_map_table[] = CLK_DIV_ADDRESS_MAP;
    clk_div_address_map_t *clk_div_addr = &clk_div_address_map_table[reg];

	 uint32_t clk_div_reg_address = clk_div_addr->reg_address;

	return REG_READ(clk_div_reg_address);
}

void sys_hal_cpu_clk_div_set(uint32_t core_index, uint32_t value)
{
	if(core_index == 0)//cpu0
	{
		sys_ll_set_cpu0_int_halt_clk_op_cpu0_speed(value);
	}
	else if(core_index == 1)//cpu1
	{
		sys_ll_set_cpu1_int_halt_clk_op_cpu1_speed(value);
	}
	else if(core_index == 2)//cpu2
	{
		sys_ll_set_cpu2_int_halt_clk_op_cpu2_speed(value);
	}
}
uint32_t sys_hal_cpu_clk_div_get(uint32_t core_index)
{
	uint32_t value = 2;
	if(core_index == 0)//cpu0
	{
		value = sys_ll_get_cpu0_int_halt_clk_op_cpu0_speed();
	}
	else if(core_index == 1)//cpu1
	{
		value = sys_ll_get_cpu1_int_halt_clk_op_cpu1_speed();
	}
	else if(core_index == 2)//cpu2
	{
		value = sys_ll_get_cpu2_int_halt_clk_op_cpu2_speed();
	}
	return value;
}

int32 sys_hal_lp_vol_set(uint32_t value)
{
	sys_ll_set_ana_reg9_spi_latch1v(1);
	sys_ll_set_ana_reg9_vcorelsel(value);
	sys_ll_set_ana_reg9_spi_latch1v(0);

	return 0;
}

uint32_t sys_hal_lp_vol_get()
{
	return sys_ll_get_ana_reg9_vcorelsel();
}
int32 sys_hal_rf_tx_vol_set(uint32_t value)
{
	sys_ll_set_ana_reg9_spi_latch1v(1);
	sys_ll_set_ana_reg8_t_vanaldosel(value);
	sys_ll_set_ana_reg9_spi_latch1v(0);
	return 0;
}
uint32_t sys_hal_rf_tx_vol_get()
{
	return sys_ll_get_ana_reg8_t_vanaldosel();
}
int32 sys_hal_rf_rx_vol_set(uint32_t value)
{
	sys_ll_set_ana_reg9_spi_latch1v(1);
	sys_ll_set_ana_reg8_r_vanaldosel(value);
	sys_ll_set_ana_reg9_spi_latch1v(0);
	return 0;
}
uint32_t sys_hal_rf_rx_vol_get()
{
	return sys_ll_get_ana_reg8_r_vanaldosel();
}
int32 sys_hal_bandgap_cali_set(uint32_t value)//increase or decrease the dvdddig voltage
{
	return 0;
}
uint32_t sys_hal_bandgap_cali_get()
{
	return 0;
}
bk_err_t sys_hal_core_bus_clock_ctrl(uint32_t cksel_core, uint32_t ckdiv_core,uint32_t ckdiv_bus, uint32_t ckdiv_cpu0,uint32_t ckdiv_cpu1)
{
	uint32_t clk_param  = 0;
	uint32_t     h_vol  = 0;
	if(cksel_core > 3)
	{
		os_printf("set dvfs cksel core > 3 invalid %d\r\n",cksel_core);
		return BK_FAIL;
	}

	if((ckdiv_core > PM_FREQUNCY_DIV_MAX) || (ckdiv_bus > PM_FREQUNCY_DIV_BUS_MAX)||(ckdiv_cpu1 > PM_FREQUNCY_DIV_CPU_MAX)||(ckdiv_cpu0 > PM_FREQUNCY_DIV_CPU_MAX))
	{
		os_printf("set dvfs ckdiv_core ckdiv_bus ckdiv_cpu0_1  ckdiv_cpu0_1  > 1 invalid\r\n");
		return BK_FAIL;
	}
	if((cksel_core == PM_CLKSEL_CORE_320M)&&(ckdiv_core == PM_CLKDIV_CORE_0)&&(ckdiv_cpu0 != PM_CLKDV_CPU0_0))
	{
		os_printf("unsupport the cpu freq setting %d %d %d\r\n",cksel_core,ckdiv_core,ckdiv_cpu0);
		return BK_FAIL;
	}

	if((cksel_core == PM_CLKSEL_CORE_320M)&&(ckdiv_core == PM_CLKDIV_CORE_0))
	{
		h_vol = sys_hal_vdddig_h_vol_get();
		if(h_vol < PM_VDDDIG_H_VOL_0v9)
		{
			sys_hal_ctrl_vddd_h_vol(PM_VDDD_H_VOL_1V);
			sys_hal_ctrl_vdddig_h_vol(PM_VDDDIG_H_VOL_0v9);
		}
	}
	clk_param = 0;
	clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
	if(((clk_param >> 0x4)&0x3) > cksel_core)//when it from the higher frequency to lower frequency
	{
		/*1.core clk select*/
		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0x3 << 4);
		clk_param |=  cksel_core << 4;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);

		/*2.config bus and core clk div*/
		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0xF << 0);
		clk_param |=  ckdiv_core << 0;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);

		/*3.config cpu clk div*/
		sys_hal_cpu_clk_div_set(0,ckdiv_cpu0);
		sys_hal_cpu_clk_div_set(1,ckdiv_cpu1);
		sys_hal_cpu_clk_div_set(2,1);//config cpu2
	}
	else//when it from the lower frequency to higher frequency
	{
		/*1.config bus and core clk div*/
		if(ckdiv_core == 0)
		{
			sys_hal_cpu_clk_div_set(0,ckdiv_cpu0);//avoid the bus freq > 240m
		}

		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0xF << 0);
		clk_param |=  ckdiv_core << 0;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);

		/*2.config cpu clk div*/
		if(ckdiv_core != 0)
		{
			sys_hal_cpu_clk_div_set(0,ckdiv_cpu0);
		}
		sys_hal_cpu_clk_div_set(1,ckdiv_cpu1);
		sys_hal_cpu_clk_div_set(2,1);//config cpu2

		/*3.core clk select*/

		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0x3 << 4);
		clk_param |=  cksel_core << 4;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);
	}

	return BK_OK;
}

bk_err_t sys_hal_ctrl_vddd_h_vol(uint32_t vol_value)
{
#if CONFIG_RX_OPTIMIZE
	if(sys_ll_get_ana_reg9_vdighsel() != vol_value)
	{
		sys_ll_set_ana_reg9_spi_latch1v(1);
		sys_ll_set_ana_reg9_vdighsel(vol_value);
		sys_ll_set_ana_reg9_spi_latch1v(0);
		sys_hal_delay(SYS_SWITCH_VDDDIG_VOL_DELAY_TIME);//when cpu0 max freq 240m ,it delay 10uS for voltage stability
	}
#endif
	return BK_OK;
}

