bekencorp/bk_idk/middleware/soc/bk7258/hal/sys_hal.c
bk_err_t sys_hal_ctrl_vdddig_h_vol(uint32_t vol_value)
{
	if(sys_ll_get_ana_reg9_vcorehsel() != vol_value)
	{
		sys_ll_set_ana_reg9_spi_latch1v(1);
		sys_ll_set_ana_reg9_vcorehsel(vol_value);
		sys_ll_set_ana_reg9_spi_latch1v(0);
		sys_hal_delay(SYS_SWITCH_VDDDIG_VOL_DELAY_TIME);//when cpu0 max freq 240m ,it delay 10uS for voltage stability
	}

	return BK_OK;
}

uint32_t sys_hal_vdddig_h_vol_get()
{
	return sys_ll_get_ana_reg9_vcorehsel();
}
bk_err_t sys_hal_switch_cpu_bus_freq_high_to_low(pm_cpu_freq_e cpu_bus_freq)
{
	bk_err_t ret = BK_OK;
	switch(cpu_bus_freq)
	{
		case PM_CPU_FRQ_480M://cpu0:240m;cpu1:480m;cpu2:480m;bus:240m
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x0,0x0,0x0,0x1);
#if	CONFIG_DO_MIPS_FUNCTION
			os_printf("high-to-low \r\n");
			sys_hal_ctrl_vddd_h_vol(0x7);	// 1.05v
			sys_hal_ctrl_vdddig_h_vol(0xB);	//0.875V basic_vol:0.6v scale:0.025v
#else
			sys_hal_ctrl_vddd_h_vol(0x7);//  1.05v
			sys_hal_ctrl_vdddig_h_vol(0xE);//0.95V
#endif
			break;
		case PM_CPU_FRQ_320M://cpu0:160m;cpu1:320m;cpu2:320m;bus:160m
		    ret = sys_hal_core_bus_clock_ctrl(0x2,0x0,0x0,0x0,0x1);
			sys_hal_ctrl_vddd_h_vol(0x7);// 1.05 v
			sys_hal_ctrl_vdddig_h_vol(0xD);//0.925V

			break;
		case PM_CPU_FRQ_240M://cpu0:240m;cpu1:240m;;cpu2:240m;bus:240m
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x1,0x0,0x1,0x1);
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0 v
			sys_hal_ctrl_vdddig_h_vol(0xD);//0.925V

			break;
		case PM_CPU_FRQ_120M://cpu0:120m;cpu1:120m;cpu2:120m;bus:120m
#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x1,0x0,0x1,0x1);
#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x3,0x0,0x1,0x1);
#endif
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			#if CONFIG_ATE_TEST
			sys_hal_ctrl_vdddig_h_vol(0x7);//0.775V
			#else
			sys_hal_ctrl_vdddig_h_vol(0xC);//0.9V
			#endif

			break;
		case PM_CPU_FRQ_80M://cpu0:80m;cpu1:80m;cpu2:80m;bus:80m
#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x2,0x0,0x1,0x1);
#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x5,0x0,0x1,0x1);
#endif
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V

			break;
		case PM_CPU_FRQ_60M://cpu0:60m;cpu1:60m;cpu2:60m;bus:60m
#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x3,0x0,0x1,0x1);
#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x7,0x0,0x1,0x1);
#endif
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
			break;
		case PM_CPU_FRQ_26M://cpu0:26m;cpu1:26m;cpu2:26m;bus:26m
			ret = sys_hal_core_bus_clock_ctrl(0x0,0x0,0x0,0x1,0x1);
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
			break;
		default:
			break;
	}

	return ret;
}
bk_err_t sys_hal_switch_cpu_bus_freq_low_to_high(pm_cpu_freq_e cpu_bus_freq)
{
	bk_err_t ret = BK_OK;
	switch(cpu_bus_freq)
	{
		case PM_CPU_FRQ_480M://cpu0:240m;cpu1:480m;cpu2:480m;bus:240m
#if	CONFIG_DO_MIPS_FUNCTION
			os_printf("low-to-high \r\n");
			sys_hal_ctrl_vddd_h_vol(0x7);// 1.05v
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V  //basic_vol:0.6v scale:0.025v
#else
			sys_hal_ctrl_vddd_h_vol(0x7);// 1.05v
			sys_hal_ctrl_vdddig_h_vol(0xE);//0.95V
#endif
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x0,0x0,0x0,0x1);
			break;
		case PM_CPU_FRQ_320M://cpu0:160m;cpu1:320m;cpu2:320m;bus:160m
			sys_hal_ctrl_vddd_h_vol(0x7);// 1.05v
			sys_hal_ctrl_vdddig_h_vol(0xD);//0.925V
			ret = sys_hal_core_bus_clock_ctrl(0x2,0x0,0x0,0x0,0x1);
			break;
		case PM_CPU_FRQ_240M://cpu0:240m;cpu1:240m;;cpu2:240m;bus:240m
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0v
			sys_hal_ctrl_vdddig_h_vol(0xD);//0.925V
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x1,0x0,0x1,0x1);
			break;
		case PM_CPU_FRQ_120M://cpu0:120m;cpu1:120m;cpu2:120m;bus:120m
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			#if CONFIG_ATE_TEST
			sys_hal_ctrl_vdddig_h_vol(0x7);//0.775V
			#else
			sys_hal_ctrl_vdddig_h_vol(0xC);//0.9V
			#endif
#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x1,0x0,0x1,0x1);
#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x3,0x0,0x1,0x1);
#endif
			break;
		case PM_CPU_FRQ_80M://cpu0:80m;cpu1:80m;cpu2:80m;bus:80m
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x2,0x0,0x1,0x1);
#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x5,0x0,0x1,0x1);
#endif
			break;
		case PM_CPU_FRQ_60M://cpu0:60m;cpu1:60m;cpu2:60m;bus:60m
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x3,0x0,0x1,0x1);
#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x7,0x0,0x1,0x1);
#endif
			break;
		case PM_CPU_FRQ_26M://cpu0:26m;cpu1:26m;cpu2:26m;bus:26m
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
			ret = sys_hal_core_bus_clock_ctrl(0x0,0x0,0x0,0x1,0x1);
			break;
		default:
			break;
	}
	return ret;
}
static pm_cpu_freq_e s_pre_cpu_freq = PM_CPU_FRQ_120M;
bk_err_t sys_hal_switch_cpu_bus_freq(pm_cpu_freq_e cpu_bus_freq)
{
	bk_err_t ret = BK_OK;

	pm_cpu_freq_e prev_freq = s_pre_cpu_freq;

	if(prev_freq == cpu_bus_freq)
		return BK_OK;

	if(prev_freq > cpu_bus_freq)// eg: 480->60
	{
		sys_hal_switch_cpu_bus_freq_high_to_low(cpu_bus_freq);
	}
	else // eg: 60-480
	{
		sys_hal_switch_cpu_bus_freq_low_to_high(cpu_bus_freq);
	}
	s_pre_cpu_freq = cpu_bus_freq;
	return ret;
}

/*for low power function end*/
/*sleep feature end*/

uint32 sys_hal_get_chip_id(void)
{
	return sys_ll_get_version_id_versionid();
}

uint32 sys_hal_get_device_id(void)
{
	return sys_ll_get_device_id_deviceid();
}

int32 sys_hal_int_disable(uint32 param) //CMD_ICU_INT_DISABLE
{
	uint32 reg = 0;
	uint32 value = 0;

#if CONFIG_SYS_CPU0
	reg = sys_ll_get_cpu0_int_0_31_en_value();
	value = reg;
	reg &= ~(param);
	sys_ll_set_cpu0_int_0_31_en_value(reg);
#else
	reg = sys_ll_get_cpu1_int_0_31_en_value();
	value = reg;
	reg &= ~(param);
	sys_ll_set_cpu1_int_0_31_en_value(reg);
#endif

	return value;
}

int32 sys_hal_int_enable(uint32 param) //CMD_ICU_INT_ENABLE
{
	uint32 reg = 0;

