bekencorp/bk_idk/middleware/soc/bk7258/hal/sys_hal.c
#if CONFIG_SYS_CPU0
	reg = sys_ll_get_cpu0_int_0_31_en_value();
	reg |= (param);
	sys_ll_set_cpu0_int_0_31_en_value(reg);
#else
	reg = sys_ll_get_cpu1_int_0_31_en_value();
	reg |= (param);
	sys_ll_set_cpu1_int_0_31_en_value(reg);
#endif

	return 0;
}

//NOTICE:Temp add for BK7256 product which has more then 32 Interrupt sources
int32 sys_hal_int_group2_disable(uint32 param)
{
	uint32 reg = 0;
	uint32 value = 0;

#if CONFIG_SYS_CPU0
	reg = sys_ll_get_cpu0_int_32_63_en_value();
	value = reg;
	reg &= ~(param);
	sys_ll_set_cpu0_int_32_63_en_value(reg);
#else
	reg = sys_ll_get_cpu1_int_32_63_en_value();
	value = reg;
	reg &= ~(param);
	sys_ll_set_cpu1_int_32_63_en_value(reg);
#endif

	return value;
}

//NOTICE:Temp add for BK7256 product which has more then 32 Interrupt sources
int32 sys_hal_int_group2_enable(uint32 param)
{
	uint32 reg = 0;

#if CONFIG_SYS_CPU0
	reg = sys_ll_get_cpu0_int_32_63_en_value();
	reg |= (param);
	sys_ll_set_cpu0_int_32_63_en_value(reg);
#else
	reg = sys_ll_get_cpu1_int_32_63_en_value();
	reg |= (param);
	sys_ll_set_cpu1_int_32_63_en_value(reg);
#endif

	return 0;
}

#if CONFIG_SOC_BK7236_SMP_TEMP
int32 sys_hal_core_int_group1_disable(uint32 core_id, uint32 param)
{
	uint32 reg = 0;
	uint32 value = 0;

	if(CPU0_CORE_ID == core_id){
		reg = sys_ll_get_cpu0_int_0_31_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu0_int_0_31_en_value(reg);
	}
	else if(CPU1_CORE_ID == core_id){
		reg = sys_ll_get_cpu1_int_0_31_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu1_int_0_31_en_value(reg);
	}
	else if(CPU2_CORE_ID == core_id){
		reg = sys_ll_get_cpu2_int_0_31_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu2_int_0_31_en_value(reg);
	}

	return value;
}

int32 sys_hal_core_int_group1_enable(uint32 core_id, uint32 param)
{
	uint32 reg = 0;

	if(CPU0_CORE_ID == core_id){
		reg = sys_ll_get_cpu0_int_0_31_en_value();
		reg |= (param);
		sys_ll_set_cpu0_int_0_31_en_value(reg);
	}
	else if(CPU1_CORE_ID == core_id){
		reg = sys_ll_get_cpu1_int_0_31_en_value();
		reg |= (param);
		sys_ll_set_cpu1_int_0_31_en_value(reg);
	}
	else if(CPU2_CORE_ID == core_id){
		reg = sys_ll_get_cpu2_int_0_31_en_value();
		reg |= (param);
		sys_ll_set_cpu2_int_0_31_en_value(reg);
	}

	return 0;
}

int32 sys_hal_core_int_group2_disable(uint32 core_id, uint32 param)
{
	uint32 reg = 0;
	uint32 value = 0;

	if(CPU0_CORE_ID == core_id){
		reg = sys_ll_get_cpu0_int_32_63_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu0_int_32_63_en_value(reg);
	}
	else if(CPU1_CORE_ID == core_id){
		reg = sys_ll_get_cpu1_int_32_63_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu1_int_32_63_en_value(reg);
	}
	else if(CPU2_CORE_ID == core_id){
		reg = sys_ll_get_cpu2_int_32_63_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu2_int_32_63_en_value(reg);
	}

	return value;
}

int32 sys_hal_core_int_group2_enable(uint32 core_id, uint32 param)
{
	uint32 reg = 0;

	if(CPU0_CORE_ID == core_id){
		reg = sys_ll_get_cpu0_int_32_63_en_value();
		reg |= (param);
		sys_ll_set_cpu0_int_32_63_en_value(reg);
	}
	else if(CPU1_CORE_ID == core_id){
		reg = sys_ll_get_cpu1_int_32_63_en_value();
		reg |= (param);
		sys_ll_set_cpu1_int_32_63_en_value(reg);
	}
	else if(CPU2_CORE_ID == core_id){
		reg = sys_ll_get_cpu2_int_32_63_en_value();
		reg |= (param);
		sys_ll_set_cpu2_int_32_63_en_value(reg);
	}

	return 0;
}
#endif

int32 sys_hal_fiq_disable(uint32 param)
{
	uint32 reg = 0;
	uint32 value = 0;

#if CONFIG_SYS_CPU0
	reg = sys_ll_get_cpu0_int_32_63_en_value();
	value = reg;
	reg &= ~(param);
	sys_ll_set_cpu0_int_32_63_en_value(reg);
#else
	reg = sys_ll_get_cpu1_int_32_63_en_value();
	value = reg;
	reg &= ~(param);
	sys_ll_set_cpu1_int_32_63_en_value(reg);
#endif

	return value;
}

int32 sys_hal_fiq_enable(uint32 param)
{
	uint32 reg = 0;

#if CONFIG_SYS_CPU0
	reg = sys_ll_get_cpu0_int_32_63_en_value();
	reg |= (param);
	sys_ll_set_cpu0_int_32_63_en_value(reg);
#else
	reg = sys_ll_get_cpu1_int_32_63_en_value();
	reg |= (param);
	sys_ll_set_cpu1_int_32_63_en_value(reg);
#endif

	return 0;
}

//	GLOBAL_INT_DECLARATION();	GLOBAL_INT_DISABLE();
int32 sys_hal_global_int_disable(uint32 param)
{
	int32 ret = 0;

	return ret;
}

// GLOBAL_INT_RESTORE();
int32 sys_hal_global_int_enable(uint32 param)
{
	int32 ret = 0;

	return ret;
}

uint32 sys_hal_get_int_status(void)
{
#if CONFIG_SYS_CPU0
	return sys_ll_get_cpu0_int_0_31_status_value();
#else
	return sys_ll_get_cpu1_int_0_31_status_value();
#endif
}

uint32 sys_hal_get_int_group2_status(void)
{
#if CONFIG_SYS_CPU0
	return sys_ll_get_cpu0_int_32_63_status_value();
#else
	return sys_ll_get_cpu1_int_32_63_status_value();
#endif
}

/* REG_0x29:cpu0_int_32_63_status->cpu0_gpio_int_st: ,R,0x29[22]*/
uint32_t sys_hal_get_cpu0_gpio_int_st(void)
{
    return sys_ll_get_cpu0_int_32_63_status_cpu0_gpio_int_st();
}

//NOTICE:INT source status is read only and can't be set, other projects is error, we'll delete them.
int32 sys_hal_set_int_status(uint32 param)
{
	return 0;
}

uint32 sys_hal_get_fiq_reg_status(void)
{
	uint32 reg = 0;

#if CONFIG_SYS_CPU0
	reg = sys_ll_get_cpu0_int_32_63_status_value();
#else
	reg = sys_ll_get_cpu1_int_32_63_status_value();
#endif

	return reg;
}

uint32 sys_hal_set_fiq_reg_status(uint32 param)
{
	uint32 reg = 0;

	///TODO:this reg is read only

	return reg;
}

uint32 sys_hal_get_intr_raw_status(void)
{
	uint32 reg = 0;

	///TODO:
	reg = sys_ll_get_cpu0_int_0_31_status_value();

	return reg;
}

uint32 sys_hal_set_intr_raw_status(uint32 param)
{
	uint32 reg = 0;

	///TODO:this reg is read only

	return reg;
}

int32 sys_hal_set_jtag_mode(uint32 param)
{
	int32 ret = 0;
	sys_ll_set_cpu_storage_connect_op_select_jtag_core_sel(param);
	return ret;
}

uint32 sys_hal_get_jtag_mode(void)
{
	uint32 reg = 0;
	reg = sys_ll_get_cpu_storage_connect_op_select_jtag_core_sel();
	return reg;
}

/* NOTICE: NOTICE: NOTICE: NOTICE: NOTICE: NOTICE: NOTICE
 * BK7256 clock, power is different with previous products(2022-01-10).
 * Previous products peripheral devices use only one signal of clock enable.
 * BK7256 uses clock and power signal to control one device,
 * This function only enable clock signal, we needs to enable power signal also
 * if we want to enable one device.
 */
void sys_hal_clk_pwr_ctrl(dev_clk_pwr_id_t dev, dev_clk_pwr_ctrl_t power_up)
{
	uint32_t v = 0;
	uint32_t offset = 0;

	if (dev >= CLK_PWR_ID_H264) {
		offset += CLK_PWR_ID_H264;
		v = sys_ll_get_reserver_reg0xd_value();
	} else {
		offset = 0;
		v = sys_ll_get_cpu_device_clk_enable_value();
	}

	if(CLK_PWR_CTRL_PWR_UP == power_up)
		v |= (1 << (dev - offset));
	else
		v &= ~(1 << (dev - offset));

	if (dev >= CLK_PWR_ID_H264) {
		sys_ll_set_reserver_reg0xd_value(v);
	} else {
		sys_ll_set_cpu_device_clk_enable_value(v);
	}
}

/* UART select clock **/
void sys_hal_uart_select_clock(uart_id_t id, uart_src_clk_t mode)
{
	int sel_xtal = 0;
	int sel_appl = 1;

