bekencorp/bk_idk/middleware/soc/bk7258/hal/sys_hal.c
	switch(id)
	{
		case UART_ID_0:
			{
				if(mode == UART_SCLK_APLL)
					sys_ll_set_cpu_clk_div_mode1_clksel_uart0(sel_appl);
				else
					sys_ll_set_cpu_clk_div_mode1_clksel_uart0(sel_xtal);
				break;
			}
		case UART_ID_1:
			{
				if(mode == UART_SCLK_APLL)
					sys_ll_set_cpu_clk_div_mode1_cksel_uart1(sel_appl);
				else
					sys_ll_set_cpu_clk_div_mode1_cksel_uart1(sel_xtal);
				break;
			}
		case UART_ID_2:
			{
				if(mode == UART_SCLK_APLL)
					sys_ll_set_cpu_clk_div_mode1_cksel_uart2(sel_appl);
				else
					sys_ll_set_cpu_clk_div_mode1_cksel_uart2(sel_xtal);
				break;
			}
		default:
			break;
	}

}

void sys_hal_pwm_select_clock(sys_sel_pwm_t num, pwm_src_clk_t mode)
{
	int sel_clk32 = 0;
	int sel_xtal = 1;

	switch(num)
	{
		case SYS_SEL_PWM0:
			if(mode == PWM_SCLK_XTAL)
				sys_ll_set_cpu_clk_div_mode1_cksel_pwm0(sel_xtal);
			else
				sys_ll_set_cpu_clk_div_mode1_cksel_pwm0(sel_clk32);
			break;
		case SYS_SEL_PWM1:
			if(mode == PWM_SCLK_XTAL)
				sys_ll_set_cpu_clk_div_mode1_cksel_pwm1(sel_xtal);
			else
				sys_ll_set_cpu_clk_div_mode1_cksel_pwm1(sel_clk32);
			break;

		default:
			break;
	}
}

void sys_hal_timer_select_clock(sys_sel_timer_t num, timer_src_clk_t mode)
{
	int sel_clk32 = 0;
	int sel_xtal = 1;

	switch(num)
	{
		case SYS_SEL_TIMER0:
			if(mode == TIMER_SCLK_XTAL)
				sys_ll_set_cpu_clk_div_mode1_cksel_tim0(sel_xtal);
			else
				sys_ll_set_cpu_clk_div_mode1_cksel_tim0(sel_clk32);
			break;
		case SYS_SEL_TIMER1:
			if(mode == TIMER_SCLK_XTAL)
				sys_ll_set_cpu_clk_div_mode1_cksel_tim1(sel_xtal);
			else
				sys_ll_set_cpu_clk_div_mode1_cksel_tim1(sel_clk32);
			break;

		default:
			break;
	}
}

uint32_t sys_hal_timer_select_clock_get(sys_sel_timer_t id)
{
    uint32_t ret = 0;

    switch(id)
    {
        case SYS_SEL_TIMER0:
        {
            ret = sys_ll_get_cpu_clk_div_mode1_cksel_tim0();
            break;
        }
        case SYS_SEL_TIMER1:
        {
            ret = sys_ll_get_cpu_clk_div_mode1_cksel_tim1();
            break;
        }
        default:
            break;
    }

    ret = (ret)?TIMER_SCLK_XTAL:TIMER_SCLK_CLK32;

    return ret;
}

void sys_hal_spi_select_clock(spi_id_t num, spi_src_clk_t mode)
{
	int sel_xtal = 0;
	int sel_apll = 1;

	switch(num)
	{
		case SPI_ID_0:
			if(mode == SPI_CLK_XTAL)
				sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi0(sel_xtal);
			else
				sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi0(sel_apll);
			break;
#if (SOC_SPI_UNIT_NUM > 1)
		case SPI_ID_1:
			if(mode == SPI_CLK_XTAL)
				sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi1(sel_xtal);
			else
				sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi1(sel_apll);
			break;
#endif
		default:
			break;
	}
}

void sys_hal_qspi_clk_sel(uint32_t id, uint32_t param)
{
	switch(id)
	{
		case QSPI_ID_0:
			sys_ll_set_cpu_clk_div_mode2_cksel_qspi0(param);
			break;
#if (SOC_QSPI_UNIT_NUM > 1)
		case QSPI_ID_1:
			sys_ll_set_cpu_26m_wdt_clk_div_cksel_qspi1(param);
			break;
#endif
		default:
			break;
	}
}

void sys_hal_qspi_set_src_clk_div(uint32_t id, uint32_t value)
{
	switch(id)
	{
		case QSPI_ID_0:
			sys_ll_set_cpu_clk_div_mode2_ckdiv_qspi0(value);
			break;
#if (SOC_QSPI_UNIT_NUM > 1)
		case QSPI_ID_1:
			sys_ll_set_cpu_26m_wdt_clk_div_ckdiv_qspi1(value);
			break;
#endif
		default:
			break;
	}
}

#if 1	//tmp build
void sys_hal_set_clk_select(dev_clk_select_id_t dev, dev_clk_select_t clk_sel)
{
	//tmp build
}

dev_clk_select_t sys_hal_get_clk_select(dev_clk_select_id_t dev)
{
	//tmp build
	return 0;
}

//DCO divider is valid for all of the peri-devices.
void sys_hal_set_dco_div(dev_clk_dco_div_t div)
{
	//tmp build
}

//DCO divider is valid for all of the peri-devices.
dev_clk_dco_div_t sys_hal_get_dco_div(void)
{
	//tmp build
	return 0;
}
#endif	//temp build

/*clock power control end*/

void sys_hal_set_cksel_sadc(uint32_t value)
{
    sys_ll_set_cpu_clk_div_mode1_cksel_sadc(value);
}

void sys_hal_set_cksel_pwm0(uint32_t value)
{
    sys_ll_set_cpu_clk_div_mode1_cksel_pwm0(value);
}

void sys_hal_set_cksel_pwm1(uint32_t value)
{
    sys_ll_set_cpu_clk_div_mode1_cksel_pwm1(value);
}

void sys_hal_set_cksel_pwm(uint32_t value)
{
    sys_hal_set_cksel_pwm0(value);
    sys_hal_set_cksel_pwm1(value);
}

uint32_t sys_hal_uart_select_clock_get(uart_id_t id)
{
    uint32_t ret = 0;

    switch(id)
    {
        case UART_ID_0:
        {
            ret = sys_ll_get_cpu_clk_div_mode1_clksel_uart0();
            break;
        }
        case UART_ID_1:
        {
            ret = sys_ll_get_cpu_clk_div_mode1_cksel_uart1();
            break;
        }
        case UART_ID_2:
        {
            ret = sys_ll_get_cpu_clk_div_mode1_cksel_uart1();
            break;
        }
        default:
            break;
    }

    ret = (!ret)?UART_SCLK_XTAL_26M:UART_SCLK_APLL;

    return ret;
}

void sys_hal_sadc_int_enable(void)
{
    sys_hal_int_enable(SADC_INTERRUPT_CTRL_BIT);
}

void sys_hal_sadc_int_disable(void)
{
    sys_hal_int_disable(SADC_INTERRUPT_CTRL_BIT);
}

void sys_hal_sadc_pwr_up(void)
{
	sys_ll_set_cpu_device_clk_enable_sadc_cken(1);
	sys_ll_set_ana_reg2_gadc_nobuf_enable(1);
}

void sys_hal_sadc_pwr_down(void)
{
	sys_ll_set_ana_reg2_gadc_nobuf_enable(0);
	sys_ll_set_cpu_device_clk_enable_sadc_cken(0);
}

void sys_hal_set_saradc_config(void)
{
	sys_ll_set_ana_reg2_sp_nt_ctrl(0x3);
	sys_ll_set_ana_reg2_gadc_capcal(0);
	sys_ll_set_ana_reg2_gadc_nobuf_enable(0x1);
	sys_ll_set_ana_reg2_gadc_refbuf_ictrl(0x2);
	sys_ll_set_ana_reg2_gadc_inbuf_ictrl(0x2);
	sys_ll_set_ana_reg2_gadc_cmp_ictrl(0x2);
	// sys_ll_set_ana_reg2_xtalh_ctune(0x30);
}

void sys_hal_set_sdmadc_config(void)
{
	sys_ll_set_ana_reg2_sp_nt_ctrl(0x50);
	sys_ll_set_ana_reg2_gadc_capcal(0x4);
	sys_ll_set_ana_reg2_gadc_nobuf_enable(0x1);
	sys_ll_set_ana_reg2_gadc_refbuf_ictrl(0);
	sys_ll_set_ana_reg2_gadc_inbuf_ictrl(0);
	sys_ll_set_ana_reg2_gadc_cmp_ictrl(0);
	// sys_ll_set_ana_reg2_xtalh_ctune(0);
}

void sys_hal_set_clksel_spi0(uint32_t value)
{
    sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi0(value);
}

