bekencorp/bk_idk/middleware/soc/bk7258/hal/sys_hal.c
void sys_hal_set_clksel_spi1(uint32_t value)
{
    sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi1(value);
}

void sys_hal_set_clksel_spi(uint32_t value)
{
    if((SPI_CLK_SRC_XTAL == value) || (SPI_CLK_SRC_APLL == value))
    {
        sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi0(value);
        sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi1(value);
    }
    else
    {
        //os_printf("spi cksel is not support on BK7256 in function:%s, line:%d\n", __FUNCTION__, __LINE__);
    }

}

void sys_hal_en_tempdet(uint32_t value)
{
    sys_ll_set_ana_reg5_en_temp(value);
}

uint32_t sys_hal_mclk_mux_get(void)
{
	UINT32 ret = 0;

	ret = sys_ll_get_cpu_clk_div_mode1_cksel_core();

	return ret;
}

void sys_hal_mclk_mux_set(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode1_cksel_core(value);
}

uint32_t sys_hal_mclk_div_get(void)
{
	UINT32 ret = 0;

	ret = sys_ll_get_cpu_clk_div_mode1_clkdiv_core();

	return ret;
}

void sys_hal_mclk_div_set(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode1_clkdiv_core(value);
}

/**  Platform End **/




/**  BT Start **/
//BT
void sys_hal_bt_power_ctrl(bool power_up)
{
    if (power_up)
    {
        sys_ll_set_cpu_power_sleep_wakeup_pwd_btsp(0);
    }
    else
    {
        sys_ll_set_cpu_power_sleep_wakeup_pwd_btsp(1);
    }
}

void sys_hal_bt_clock_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu_device_clk_enable_btdm_cken(1);
    }
    else
    {
        sys_ll_set_cpu_device_clk_enable_btdm_cken(0);
    }
}

void sys_hal_xvr_clock_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu_device_clk_enable_xvr_cken(1);
    }
    else
    {
        sys_ll_set_cpu_device_clk_enable_xvr_cken(0);
    }
}

void sys_hal_btdm_interrupt_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_dm_irq_en(1);
            //TODO enable PLIC Int Enable Registers
    }
    else
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_dm_irq_en(0);
            //TODO disable PLIC Int Enable Registers
    }
}

void sys_hal_ble_interrupt_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_ble_irq_en(1);
            //TODO enable PLIC Int Enable Registers
    }
    else
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_ble_irq_en(0);
            //TODO disable PLIC Int Enable Registers
    }
}

void sys_hal_bt_interrupt_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_bt_irq_en(1);
            //TODO enable PLIC Int Enable Registers
    }
    else
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_bt_irq_en(0);
            //TODO disable PLIC Int Enable Registers
    }
}

void sys_hal_bt_rf_ctrl(bool en)
{
    if (en)
    {
        //todo
    }
    else
    {
        //todo
    }
}

uint32_t sys_hal_bt_rf_status_get(void)
{
    //todo
    return 0;
}

void sys_hal_bt_sleep_exit_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu_power_sleep_wakeup_bts_soft_wakeup_req(1);
    }
    else
    {
        sys_ll_set_cpu_power_sleep_wakeup_bts_soft_wakeup_req(0);
    }
}

void sys_hal_set_bts_wakeup_platform_en(bool value)
{
	/*TODO
	sys_ll_set_cpu_power_sleep_wakeup_bts_wakeup_platform_en(value);*/
	while(1){;}
}

uint32 sys_hal_get_bts_wakeup_platform_en()
{
	/*TODO
	sys_ll_get_cpu_power_sleep_wakeup_bts_wakeup_platform_en();*/
	while(1){;}
	return 0;
}

/**  BT End **/


/**  Audio Start **/
//Audio
/**  Audio End **/

/**  Video Start **/
/**
  * @brief	lcd_disp  system config
  * param1: clk source sel 0:clk_320M      1:clk_480M,
  * param2: clk_div  F/(1+clkdiv_disp_l+clkdiv_disp_h*2)
  * param1: int_en eanble lcd cpu int
  * param2: clk_always_on, BUS_CLK ENABLE,0: bus clock open when module is select,1:bus clock always open,  0 by defult
  * return none
  */
void sys_hal_lcd_disp_clk_en(uint8_t clk_src_sel, uint8_t clk_div_l, uint8_t clk_div_h, uint8_t clk_always_on)
{
	sys_ll_set_cpu_clk_div_mode1_clkdiv_disp_l(clk_div_l);
	sys_ll_set_cpu_clk_div_mode2_clkdiv_disp_h(clk_div_h);
	sys_ll_set_cpu_clk_div_mode2_cksel_disp( clk_src_sel);
//	sys_ll_set_cpu1_int_0_31_en_cpu1_lcd_display_int_en( 1);
//	sys_ll_set_cpu0_int_0_31_en_cpu0_lcd_display_int_en( int_en);
	sys_ll_set_cpu_device_clk_enable_disp_cken(1);
}

/**
  * @brief	lcd clk close and int disable, reg value recover default.
  * return none
  */
void sys_hal_lcd_disp_close(void)
{
	sys_ll_set_cpu_clk_div_mode1_clkdiv_disp_l(0);
	sys_ll_set_cpu_clk_div_mode2_clkdiv_disp_h(0);
	sys_ll_set_cpu_clk_div_mode2_cksel_disp(0);
	//sys_ll_set_cpu1_int_0_31_en_cpu1_lcd_int_en(&s_sys_hal, 1);
	//sys_ll_set_cpu0_int_0_31_en_cpu0_lcd_int_en(0);
	sys_ll_set_cpu_device_clk_enable_disp_cken(0);
	//sys_ll_set_cpu_mode_disckg2_disp_disckg(0);
}

/**
  * @brief	dma2d system config
  * param1: clk source sel 0:clk_320M	   1:clk_480M,
  * param2: clk_always_on  ENABLE,0: bus clock auto open when module is select,1:bus clock always open
  * param1: int_en eanble lcd cpu int
  * return none
  */
void sys_hal_dma2d_clk_en(uint8_t clk_always_on)
{
}

void sys_hal_set_jpeg_dec_disckg(uint32_t value)
{
}

void sys_hal_set_slcd_clk_en(bool enable)
{
	sys_ll_set_reserver_reg0xd_slcd_cken(enable);
}

void sys_hal_set_slcd_sw_bias(uint32_t value)
{
    sys_ll_set_ana_reg4_sw_bias(value);
}

void sys_hal_set_slcd_crb(uint32_t value)
{
    sys_ll_set_ana_reg4_crb(value);
}

void sys_hal_set_slcd_com_enable(uint32_t value)
{
    sys_ll_set_ana_reg4_port_enablel(value);
}

void sys_hal_set_slcd_seg_enable(uint32_t value)
{
    sys_ll_set_ana_reg7_port_enablel(value);
}

uint32_t sys_hal_get_slcd_seg_enable_status(void)
{
    uint32_t status = sys_ll_get_ana_reg7_port_enablel();
    return status;
}

void sys_hal_set_slcd_enable(bool enable)
{
    sys_ll_set_ana_reg5_en_lcd(enable);
}

/**  Video End **/

/**  WIFI Start **/
//WIFI

//Yantao Add Start
void sys_hal_modem_core_reset(void)
{
	//TODO, 7256 NO modem core reset
}

void sys_hal_mpif_invert(void)
{
	//TODO, 7256 NO mpif_invert
}

void sys_hal_modem_subsys_reset(void)
{
	//TODO, 7256 NO subsys reset
}
void sys_hal_mac_subsys_reset(void)
{
	//TODO, 7256 NO subsys reset
}
void sys_hal_usb_subsys_reset(void)
{
	//TODO, 7256 NO subsys reset
}
void sys_hal_dsp_subsys_reset(void)
{
	//TODO, 7256 NO subsys reset
}
void sys_hal_mac_power_ctrl(bool power_up)
{
	//WARNING:the low-level is power-down
	sys_ll_set_cpu_power_sleep_wakeup_pwd_wifp_mac(!(power_up));
}

