bekencorp/bk_idk/middleware/soc/bk7258/hal/sys_hal.c
void sys_hal_modem_power_ctrl(bool power_up)
{
	sys_ll_set_cpu_power_sleep_wakeup_pwd_wifp_phy(!(power_up));
}

void sys_hal_pta_ctrl(bool pta_en)
{
	//TODO, 7256 NO pta enable
}

void sys_hal_modem_bus_clk_ctrl(bool clk_en)
{
	//TODO, 7256 no bus clock enable
}

void sys_hal_modem_clk_ctrl(bool clk_en)
{
	sys_ll_set_cpu_device_clk_enable_phy_cken(clk_en);
}


void sys_hal_mac_bus_clk_ctrl(bool clk_en)
{
	//TODO, 7256 no bus clock enable
}

void sys_hal_mac_clk_ctrl(bool clk_en)
{
	sys_ll_set_cpu_device_clk_enable_mac_cken(clk_en);
}



void sys_hal_set_vdd_value(uint32_t param)
{
	sys_hal_ctrl_vdddig_h_vol(param);
}

uint32_t sys_hal_get_vdd_value(void)
{
	//TODO reg0x43 Write only
	return sys_ll_get_ana_reg9_vcorehsel();
}

//CMD_SCTRL_BLOCK_EN_MUX_SET
void sys_hal_block_en_mux_set(uint32_t param)
{
	//TODO 7256 no block en mux
}
void sys_hal_enable_mac_gen_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_wifi_mac_int_gen_en(1);
}
void sys_hal_enable_mac_prot_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_wifi_mac_int_prot_trigger_en(1);
}
void sys_hal_enable_mac_tx_trigger_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_wifi_mac_int_tx_trigger_en(1);
}
void sys_hal_enable_mac_rx_trigger_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_wifi_mac_int_rx_trigger_en(1);
}
void sys_hal_enable_mac_txrx_misc_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_wifi_mac_int_tx_rx_misc_en(1);
}
void sys_hal_enable_mac_txrx_timer_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_wifi_mac_int_tx_rx_timer_en(1);
}

void sys_hal_enable_modem_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_wifi_int_phy_mpb_en(1);
}
void sys_hal_enable_modem_rc_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_wifi_int_phy_riu_en(1);
}

void sys_hal_enable_hsu_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_wifi_hsu_irq_en(1);
}


void sys_hal_disable_hsu_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_wifi_hsu_irq_en(0);
}

//Yantao Add End

void sys_hal_cali_dpll_spi_trig_disable(void)
{
    sys_ll_set_ana_reg0_spitrig(0);
}

void sys_hal_cali_dpll_spi_trig_enable(void)
{
    sys_ll_set_ana_reg0_spitrig(1);
}

void sys_hal_cali_dpll_spi_detect_disable(void)
{
    sys_ll_set_ana_reg0_spideten(0);
}

void sys_hal_cali_dpll_spi_detect_enable(void)
{
    sys_ll_set_ana_reg0_spideten(1);
}

void sys_hal_set_xtalh_ctune(uint32_t value)
{
    sys_ll_set_ana_reg2_xtalh_ctune(value);
}

void sys_hal_analog_set(analog_reg_t reg, uint32_t value)
{
    uint32_t analog_reg_address;

    if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
        return;
    }

    analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	sys_ll_set_analog_reg_value(analog_reg_address, value);
}
uint32_t sys_hal_analog_get(analog_reg_t reg)
{
    uint32_t analog_reg_address;

    if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
        return 0;
    }

    analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	return sys_ll_get_analog_reg_value(analog_reg_address);
}
void sys_hal_set_ana_reg1_value(uint32_t value)
{
    sys_ll_set_ana_reg1_value(value);
}

void sys_hal_set_ana_reg2_value(uint32_t value)
{
    sys_ll_set_ana_reg2_value(value);
}

void sys_hal_set_ana_reg3_value(uint32_t value)
{
    sys_ll_set_ana_reg3_value(value);
}

void sys_hal_set_ana_reg4_value(uint32_t value)
{
    sys_ll_set_ana_reg4_value(value);
}

void sys_hal_set_ana_reg12_value(uint32_t value)
{
    sys_ll_set_ana_reg12_value(value);
}

void sys_hal_set_ana_reg13_value(uint32_t value)
{
    sys_ll_set_ana_reg13_value(value);
}

void sys_hal_set_ana_reg14_value(uint32_t value)
{
    sys_ll_set_ana_reg14_value(value);
}

void sys_hal_set_ana_reg15_value(uint32_t value)
{
    sys_ll_set_ana_reg15_value(value);
}

void sys_hal_set_ana_reg16_value(uint32_t value)
{
    sys_ll_set_ana_reg16_value(value);
}

void sys_hal_set_ana_reg17_value(uint32_t value)
{
    sys_ll_set_ana_reg17_value(value);
}

void sys_hal_set_ana_reg18_value(uint32_t value)
{
    sys_ll_set_ana_reg18_value(value);
}

void sys_hal_set_ana_reg19_value(uint32_t value)
{
    sys_ll_set_ana_reg19_value(value);
}

void sys_hal_set_ana_reg20_value(uint32_t value)
{
    sys_ll_set_ana_reg20_value(value);
}

void sys_hal_set_ana_reg21_value(uint32_t value)
{
    sys_ll_set_ana_reg21_value(value);
}

void sys_hal_set_ana_reg27_value(uint32_t value)
{
    sys_ll_set_ana_reg27_value(value);
}

uint32_t sys_hal_bias_reg_read(void)
{
	///TODO
    return 0;
}
uint32_t sys_hal_bias_reg_write(uint32_t param)
{
	///TODO

	return 0;

}

uint32_t sys_hal_analog_reg2_get(void)
{
	///TODO

    return 0;
}

uint32_t sys_hal_bias_reg_set(uint32_t param)
{
	///TODO

	return 0;
}

uint32_t sys_hal_bias_reg_clean(uint32_t param)
{
	///TODO

	return 0;
}


uint32_t sys_hal_get_xtalh_ctune(void)
{
    return sys_ll_get_ana_reg2_xtalh_ctune();
}

uint32_t sys_hal_cali_bgcalm(void)
{
    uint32_t bandgap;

    sys_ll_set_ana_reg9_spi_latch1v(1);
    sys_ll_set_ana_reg8_pwd_bgcal(0);
    sys_ll_set_ana_reg8_vbgcalmode(0);
    sys_ll_set_ana_reg8_vbgcalstart(0);
    sys_ll_set_ana_reg8_vbgcalstart(1);
    delay_us(100); //100us
    sys_ll_set_ana_reg8_vbgcalstart(0);

    delay_us(2000); //2ms to avoid consistency issue

    bandgap = aon_pmu_ll_get_r7d_bgcal();

    sys_ll_set_ana_reg8_vbgcalmode(1);
    sys_ll_set_ana_reg8_pwd_bgcal(1);
    sys_ll_set_ana_reg9_spi_latch1v(0);

    return bandgap;
}

uint32_t sys_hal_get_bgcalm(void)
{
    return sys_ll_get_ana_reg8_bgcal();
}

void sys_hal_set_bgcalm(uint32_t value)
{
    sys_ll_set_ana_reg9_spi_latch1v(1);
    sys_ll_set_ana_reg8_bgcal(value);
    sys_ll_set_ana_reg9_spi_latch1v(0);
}

void sys_hal_set_audioen(uint32_t value)
{
	//sys_ll_set_ana_reg11_audioen(value);
}

void sys_hal_set_dpll_div_cksel(uint32_t value)
{
    //sys_ll_set_ana_reg11_cksel(value);
}

void sys_hal_set_dpll_reset(uint32_t value)
{
    //sys_ll_set_ana_reg11_reset(value);
}

void sys_hal_set_gadc_ten(uint32_t value)
{
    //sys_ll_set_ana_reg7_gadc_ten(value);
}
/**  WIFI End **/

/**  Audio Start  **/

void sys_hal_aud_select_clock(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode1_cksel_aud(value);
}

void sys_hal_aud_clock_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_aud_cken(value);
}

