bekencorp/bk_idk/middleware/soc/bk7258/hal/sys_hal.c
void sys_hal_set_auxs_cis_clk_div(uint32_t value)
{
	sys_ll_set_cpu_26m_wdt_clk_div_ckdiv_auxs_cis(value);
}

void sys_hal_set_jpeg_clk_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_jpeg_cken(value);
}

void sys_hal_set_cis_auxs_clk_en(uint32_t value)
{
	sys_ll_set_reserver_reg0xd_cis_auxs_cken(value);
}

/** jpeg end **/

/** h264 Start **/
void sys_hal_set_h264_clk_en(uint32_t value)
{
	sys_ll_set_reserver_reg0xd_h264_cken(value);
}

/** h264 End **/

/**  psram Start **/
void sys_hal_psram_volstage_sel(uint32_t enable)
{
	sys_ll_set_ana_reg13_psldo_swb(enable); //1-1.8v, 0-3.0v
}

void sys_hal_psram_xtall_osc_enable(uint32_t enable)
{
	sys_ll_set_ana_reg5_en_xtall(enable);
}

void sys_hal_psram_doc_enable(uint32_t enable)
{
	sys_ll_set_ana_reg5_en_dco(enable);
}

void sys_hal_psram_ldo_enable(uint32_t enable)
{
	sys_ll_set_ana_reg13_enpsram(enable);
}

uint32_t sys_hal_psram_ldo_status()
{
	return sys_ll_get_ana_reg13_enpsram();
}

void sys_hal_psram_dpll_enable(uint32_t enable)
{
	sys_ll_set_ana_reg5_en_dpll(enable);
}

void sys_hal_psram_clk_sel(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_psram(value);
}

void sys_hal_psram_set_clkdiv(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_ckdiv_psram(value);
}

void sys_hal_psram_psldo_vsel(uint32_t value)
{
	sys_ll_set_ana_reg13_vpsramsel(value);// 1.8V + step 50mv
}

void sys_hal_psram_psldo_vset(uint32_t output_voltage, uint32_t is_add_200mv)
{
	// psldo_swb=1, vpsramsel=0 - 1.80v
	// psldo_swb=1, vpsramsel=1 - 1.85v
	// psldo_swb=1, vpsramsel=2 - 1.90v
	// psldo_swb=1, vpsramsel=3 - 1.95v
	// psldo_swb=0, vpsramsel=* - 3.00v
	sys_ll_set_ana_reg13_psldo_swb(output_voltage); //1-1.8v, 0-3.0v
	sys_ll_set_ana_reg13_vpsramsel(is_add_200mv);// 1.8V + step 50mv
}

void sys_hal_psram_psram_disckg(uint32_t value)
{
	// not support
}

/**  psram End **/

/* REG_0x03:cpu_storage_connect_op_select->flash_sel:0: normal flash operation 1:flash download by spi,R/W,0x3[9]*/
uint32_t sys_hal_get_cpu_storage_connect_op_select_flash_sel(void)
{
    return sys_ll_get_cpu_storage_connect_op_select_flash_sel();
}

void sys_hal_set_cpu_storage_connect_op_select_flash_sel(uint32_t value)
{
    sys_ll_set_cpu_storage_connect_op_select_flash_sel(value);
}

void sys_hal_set_sys2flsh_2wire(uint32_t value)
{
	sys_ll_set_sys2flsh_2wire(value);
}

/** Ethernet start **/
#ifdef CONFIG_ETH
void sys_hal_enable_eth_int(uint32_t value)
{
    sys_ll_set_cpu0_int_32_63_en_cpu0_eth_int_en(value);
}
#endif
/** Ethernet End**/

/**  Misc Start **/
//Misc
/**  Misc End **/

void sys_hal_set_ana_trxt_tst_enable(uint32_t value)
{
	//sys_ll_set_ana_reg5_trxt_tst_enable(value);
}


void sys_hal_set_ana_scal_en(uint32_t value)
{
	//sys_ll_set_ana_reg7_scal_en(value);
}


void sys_hal_set_ana_gadc_buf_ictrl(uint32_t value)
{
   //sys_ll_set_ana_reg7_gadc_buf_ictrl(value);
}

void sys_hal_set_ana_gadc_cmp_ictrl(uint32_t value)
{
    //sys_ll_set_ana_reg7_gadc_cmp_ictrl(value);
}

void sys_hal_set_ana_pwd_gadc_buf(uint32_t value)
{
	//sys_ll_set_ana_reg6_pwd_gadc_buf(value);
}

void sys_hal_set_ana_vref_sel(uint32_t value)
{
	//sys_ll_set_ana_reg7_vref_sel(value);
}
void sys_hal_set_ana_cb_cal_manu(uint32_t value)
{
    sys_ll_set_ana_reg5_bcal_en(value);
}

void sys_hal_set_ana_cb_cal_trig(uint32_t value)
{
    sys_ll_set_ana_reg5_bcal_start(value);
}
void sys_hal_set_ana_vlsel_ldodig(uint32_t value)
{
    //sys_ll_set_ana_reg3_vlsel_ldodig(value);
}
void sys_hal_set_ana_vhsel_ldodig(uint32_t value)
{
    //sys_ll_set_ana_reg3_vhsel_ldodig(value);
}

void sys_hal_set_sdio_clk_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_sdio_cken(value);
}

void sys_hal_set_cpu0_sdio_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_sdio_int_en(value);
}

void sys_hal_set_cpu1_sdio_int_en(uint32_t value)
{
	sys_ll_set_cpu1_int_0_31_en_cpu1_sdio_int_en(value);
}

void sys_hal_set_sdio_clk_div(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_ckdiv_sdio(value);
}

uint32_t sys_hal_get_sdio_clk_div()
{
	return sys_ll_get_cpu_clk_div_mode2_ckdiv_sdio();
}

void sys_hal_set_sdio_clk_sel(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_sdio(value);
}

uint32_t sys_hal_get_sdio_clk_sel()
{
	return sys_ll_get_cpu_clk_div_mode2_cksel_sdio();
}


void sys_hal_set_ana_vctrl_sysldo(uint32_t value)
{
    //sys_ll_set_ana_reg5_vctrl_sysldo(value);
}

void sys_hal_set_yuv_buf_clock_en(uint32_t value)
{
	sys_ll_set_reserver_reg0xd_yuv_cken(value);
}

void sys_hal_set_h264_clock_en(uint32_t value)
{
	sys_ll_set_reserver_reg0xd_h264_cken(value);
}

void sys_hal_nmi_wdt_set_clk_div(uint32_t value)
{
	sys_ll_set_cpu_26m_wdt_clk_div_ckdiv_wdt(value);
}

uint32_t sys_hal_nmi_wdt_get_clk_div(void)
{
	return sys_ll_get_cpu_26m_wdt_clk_div_ckdiv_wdt();
}


void sys_hal_set_ana_cb_cal_manu_val(uint32_t value)
{
	sys_ll_set_ana_reg5_vbias(value);
}

void sys_hal_set_ana_reg11_apfms(uint32_t value) {
	sys_ll_set_ana_reg11_apfms(value);
}

void sys_hal_set_ana_reg12_dpfms(uint32_t value) {
	sys_ll_set_ana_reg12_dpfms(value);
}

void sys_hal_set_rott_int_en(uint32_t value)
{
	uint32_t int_level = rtos_enter_critical();

#if CONFIG_SYS_CPU0
	sys_ll_set_cpu0_int_32_63_en_cpu0_rott_int_en(value);
#else
	sys_ll_set_cpu1_int_32_63_en_cpu1_rott_int_en(value);
#endif

	rtos_exit_critical(int_level);
}

static void sys_hal_delay(volatile uint32_t times)
{
        while(times--);
}

uint32_t sys_hal_cali_dpll(uint32_t param)
{
    sys_hal_cali_dpll_spi_trig_disable();

    if (!param)
    {
        sys_hal_delay(120);
    }
    else
    {
        sys_hal_delay(60);
    }

    sys_hal_cali_dpll_spi_trig_enable();
    sys_hal_cali_dpll_spi_detect_disable();

    if (!param)
    {
        sys_hal_delay(3400);
    }
    else
    {
        sys_hal_delay(340);
    }

	sys_hal_cali_dpll_spi_detect_enable();

    if (!param)
    {
        sys_hal_delay(3400);
    }
    else
    {
        sys_hal_delay(340);
    }

    return BK_OK;
}
static void sys_hal_dpll_cpu_flash_time_early_init(uint32_t chip_id)
{
	uint32_t coresel = 0;
	uint32_t corediv = 0;
	//zhangheng20231018: calibrate dpll before use
	/*0x2:320M, 0X3:480M*/
	sys_hal_delay(120);
	coresel = sys_ll_get_cpu_clk_div_mode1_cksel_core();
	corediv = sys_ll_get_cpu_clk_div_mode1_clkdiv_core();
	if((coresel != PM_CLKSEL_CORE_320M) || (coresel != PM_CLKSEL_CORE_480M))
	{
		sys_hal_cali_dpll(0);
	}

	if (((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MPW_V2_3 & PM_CHIP_ID_MASK))
	|| ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MPW_V4 & PM_CHIP_ID_MASK))) {
		sys_hal_flash_set_clk(0x2);
	} else {
		/*default of MP flash 80M = 480/6*/
		if(sys_ll_get_cpu_clk_div_mode2_cksel_flash() != PM_CLKSEL_FLASH_480M)
		{
			if(sys_ll_get_cpu_clk_div_mode2_ckdiv_flash() != 0x1)// 480/6
			{
				sys_ll_set_cpu_clk_div_mode2_ckdiv_flash(0x1);
			}
			sys_hal_flash_set_clk(PM_CLKSEL_FLASH_480M);
		}
	}

