bekencorp/bk_idk/middleware/soc/bk7258/hal/sys_hal.c
	/* clk_divd 120MHz,
	 * 1, the core clock is depended on CONFIG_CPU_FREQ_HZ and configSYSTICK_CLOCK_HZ.
	 *    Pay attention to bk_pm_module_vote_cpu_freq,and the routine will switch core
	 *    clock;
	 * 2, sysTick module's clock source is processor clock now;
	 */
	if((coresel != PM_CLKSEL_CORE_320M) && (corediv != 0x1))//160M
	{
		sys_hal_mclk_div_set(480000000/CONFIG_CPU_FREQ_HZ - 1);
		sys_hal_delay(10000);

		sys_hal_mclk_mux_set(0x3);/*clock source: DPLL, 480M*/
	}
	timer_hal_us_init();

	/*increase the anaspi_freq, current it only use for lpo: external 32k, 26m/32k*/
	//if(bk_clk_32k_customer_config_get() != PM_LPO_SRC_ROSC)
	{
		sys_ll_set_cpu_anaspi_freq_anaspi_freq(0x2);//ana_sck = bus_clk/((divd+1)*2))
	}
}
static void sys_hal_pwd_rosc()
{
	uint32_t chip_id = aon_pmu_hal_get_chipid();
	volatile uint32_t count = PM_POWER_ON_ROSC_STABILITY_TIME;

	if ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MP_A & PM_CHIP_ID_MASK))
	{
		/*when the lpo src select external 32k or 26m/32k, it disable the rosc;because make sure write the analog register successfully*/
		if(bk_clk_32k_customer_config_get() != PM_LPO_SRC_ROSC)
		{
			if(aon_pmu_ll_get_r41_lpo_config() == PM_LPO_SRC_ROSC)
			{
				aon_pmu_ll_set_r41_lpo_config(PM_LPO_SRC_DIVD);
			}

			if(sys_ll_get_ana_reg5_pwd_rosc_spi() != 0x1)
			{
				sys_ll_set_ana_reg5_pwd_rosc_spi(0x1);
			}
		}
		else
		{
			if(sys_ll_get_ana_reg5_pwd_rosc_spi() != 0x0)
			{
				sys_ll_set_ana_reg5_pwd_rosc_spi(0x0);

				while(count--)//delay time for stability when power on rosc
				{
				}
			}
		}
	}
	else
	{
		if(sys_ll_get_ana_reg5_pwd_rosc_spi() != 0x0)
		{
			sys_ll_set_ana_reg5_pwd_rosc_spi(0x0);

			while(count--)//delay time for stability when power on rosc
			{
			}
		}
	}
	
}
//TODO the module owner can put the sys init to better place
void sys_hal_early_init(void)
{
	/*power down rosc, temp modify*/
	sys_hal_pwd_rosc();

	uint32_t chip_id = aon_pmu_hal_get_chipid();

	uint32_t val = sys_hal_analog_get(ANALOG_REG5);
	val &= ~(0x1 << 13); // power up apll then power down to reinit after deep sleep
	val |= (0x1 << 5) | (0x1 << 3) | (0x1 << 2);
	sys_hal_analog_set(ANALOG_REG5,val);
	//donghui20230504: 0:1/7 1:1/5 2:1/3 3:1/1
	sys_ll_set_ana_reg5_adc_div(1); //tenglong20230627 adc_div=1/5 since volt of GPIO <= 3.3V
	sys_ll_set_ana_reg5_pwdaudpll(1);

	val = sys_hal_analog_get(ANALOG_REG0);
	val |= (0x13 << 20) ;
	sys_hal_analog_set(ANALOG_REG0,val);

	sys_hal_analog_set(ANALOG_REG0, 0xF1305B56);  //zhangheng20231020 <0>=0 pdll test disalbe for safe
	sys_ll_set_ana_reg0_dsptrig(1);
	sys_ll_set_ana_reg0_dsptrig(0);

	sys_hal_analog_set(ANALOG_REG2, 0x7E003450); //wangjian20221110 xtal=0x50
	//sys_ll_set_cpu_device_clk_enable_value(0x0c008084);
	sys_hal_analog_set(ANALOG_REG3, 0xC5F00B88);

	/**
	 * attention:
	 * SPI latch must be enable before ana_reg[8~13] modification
	 * and don't forget disable it after that.
	 */
	sys_ll_set_ana_reg9_spi_latch1v(1);
	if ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MPW_V2_3 & PM_CHIP_ID_MASK)) {
		sys_hal_analog_set(ANALOG_REG8, 0x57E62FFE);
	} else {
		sys_hal_analog_set(ANALOG_REG8, 0x57E62F26);//shuguang20230414[8:3]7->4: for evm
	}
	//tenglong20231113: <8:5>=5 <3:0>=4 keep GPIO5/4 pullup when powerup
	sys_hal_analog_set(ANALOG_REG9, 0x787BC8A4); //tenglong20231017: revert <15> to 1 for softstart, should not change it
	if ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MPW_V2_3 & PM_CHIP_ID_MASK)) {
		sys_hal_analog_set(ANALOG_REG10, 0xC35543C7);//tenglong20230417:rosc config for buck in lowpower
		sys_hal_analog_set(ANALOG_REG11, 0x9FEF31F7);
		sys_hal_analog_set(ANALOG_REG12, 0x9F03EF6F);
		sys_hal_analog_set(ANALOG_REG13, 0x1F6FB3FF);
	} else if ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MPW_V4 & PM_CHIP_ID_MASK)) {
		sys_hal_analog_set(ANALOG_REG10, 0xC35543C7);//tenglong20230417:rosc config for buck in lowpower
		sys_hal_analog_set(ANALOG_REG11, 0x977EB9FF);
		sys_hal_analog_set(ANALOG_REG12, 0x977ECA4A);
		sys_hal_analog_set(ANALOG_REG13, 0x547AB0F5);
	} else if ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MP_A & PM_CHIP_ID_MASK)){
		sys_hal_analog_set(ANALOG_REG10, 0xC35543C7);//tenglong20230417:rosc config for buck in lowpower
		//default of MP
		//tenglong20231017: SYS_reg0x4B<3:0>=8,SYS_reg0x4C<3:0>=0,SYS_reg0x4D<4:1>=7 for softstart
		sys_hal_analog_set(ANALOG_REG11, 0x907EB878);
		sys_hal_analog_set(ANALOG_REG12, 0x907ECA40);
		sys_hal_analog_set(ANALOG_REG13, 0x727070EE);//tenglong20231020 disable psram/update volt for safe
		sys_hal_analog_set(ANALOG_REG25, 0x961FAA4);

		sys_ll_set_ana_reg3_inbufen0v9(1);
	} else if ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MP_I & PM_CHIP_ID_MASK)) {
		sys_hal_analog_set(ANALOG_REG10, 0xC3D543E7);//tenglong20240123
		//default of MP
		//tenglong20231017: SYS_reg0x4B<3:0>=8,SYS_reg0x4C<3:0>=0,SYS_reg0x4D<4:1>=7 for softstart
		sys_hal_analog_set(ANALOG_REG11, 0xB47E99F8);//tenglong20240418
		sys_hal_analog_set(ANALOG_REG12, 0xB47ECF20);//tenglong20240418
		sys_hal_analog_set(ANALOG_REG13, 0x727070EE);//tenglong20231020 disable psram/update volt for safe
		sys_hal_analog_set(ANALOG_REG25, 0x961FAA4);

		sys_ll_set_ana_reg3_inbufen0v9(1);
	} else {
		sys_hal_analog_set(ANALOG_REG10, 0xC3D543A7);//tenglong20240123
		//default of MP
		//tenglong20231017: SYS_reg0x4B<3:0>=8,SYS_reg0x4C<3:0>=0,SYS_reg0x4D<4:1>=7 for softstart
		sys_hal_analog_set(ANALOG_REG11, 0xB47E99F8);//tenglong20240418
		sys_hal_analog_set(ANALOG_REG12, 0xB47ECF20);//tenglong20240418
		sys_hal_analog_set(ANALOG_REG13, 0x727070EE);//tenglong20231020 disable psram/update volt for safe
		sys_hal_analog_set(ANALOG_REG25, 0x961FAA4);

		sys_ll_set_ana_reg3_inbufen0v9(1);

	}
	sys_ll_set_ana_reg9_spi_latch1v(0);

	/*early init cpu flash time*/
	sys_hal_dpll_cpu_flash_time_early_init(chip_id);
}
